{
    "data": {
        "pdf" : "Als PDF herunterladen",
        "pdf_url": "/assets/pdf/Lebenslauf_Liudmyla_Chernyk.pdf",
        "profileData": [
            {
                "label": "Adresse",
                "text": "Dresden, Deutschland"
            },
            {
                "label": "E-Mail",
                "text": "chernykliudmyla@gmail.com"
            },
            {
                "label": "Familienstand",
                "text": "Verheiratet"
            },
            {
                "label": "Führerschein",
                "text": "Klasse B"
            }
        ],
        "details" : "Zur Person",
        "address" : "Adresse",
        "country": "Deutschland",
        "city": "Dresden",
        "mail": {
            "label": "E-Mail",
            "text": "chernykliudmyla@gmail.com"
        },
        "drive_license": {
            "label": "Führerschein",
            "text": "Klasse B"
        },
        "skills": {
            "label": "Fähigkeiten",
            "text": [
                {
                    "label": "Programmier- und Auszeichnungs&shy;sprachen",
                    "arr": [
                        {
                            "label": "PHP",
                            "level": "11"
                        },
                        {
                            "label": "Python",
                            "level": "8"
                        },
                        {
                            "label": "JavaScript",
                            "level": "11"
                        },
                        {
                            "label": "SQL",
                            "level": "11"
                        },
                        {
                            "label": "HTML",
                            "level": "12"
                        },
                        {
                            "label": "MD",
                            "level": "9"
                        },
                        {
                            "label": "CSS",
                            "level": "12"
                        }
                    ]
                },
                {
                    "label": "Frameworks",
                    "arr": [
                        {
                            "label": "Laravel",
                            "level": "11"
                        },
                        {
                            "label": "Symphony",
                            "level": "9"
                        },
                        {
                            "label": "Django",
                            "level": "9"
                        },
                        {
                            "label": "jQuery",
                            "level": "11"
                        },
                        {
                            "label": "Vue.js",
                            "level": "10"
                        },
                        {
                            "label": "Angular",
                            "level": "6"
                        },
                        {
                            "label": "Bootstrap",
                            "level": "11"
                        },
                        {
                            "label": "Tailwind",
                            "level": "10"
                        }
                    ]
                },
                {
                    "label": "Management-Systeme",
                    "arr": [
                        {
                            "label": "Magento 2",
                            "level": "9"
                        },
                        {
                            "label": "Dolibarr",
                            "level": "10"
                        },
                        {
                            "label": "WordPress",
                            "level": "8"
                        }
                    ]
                },
                {
                    "label": "Andere Fähigkeiten",
                    "arr": [
                        {
                            "label": "Git",
                            "level": "10"
                        },
                        {
                            "label": "Regular Expressions",
                            "level": "12"
                        },
                        {
                            "label": "ORM",
                            "level": "12"
                        },
                        {
                            "label": "OOP",
                            "level": "11"
                        },
                        {
                            "label": "APIs",
                            "level": "10"
                        },
                        {
                            "label": "JSON",
                            "level": "12"
                        },
                        {
                            "label": "XML",
                            "level": "12"
                        }
                    ]
                }
            ]
        },
        "languages": {
            "label": "Sprachen",
            "max-level": "12",
            "_comment": "max-level not used, it is here just to relate skills level",
            "text": [
                {
                    "label": "Deutsch (B2)",
                    "level": "8",
                    "level_text": "B2"
                },
                {
                    "label": "Englisch (B1+)",
                    "level": "7",
                    "level_text": "B1"
                },
                {
                    "label": "Ukrainisch",
                    "level": "12",
                    "level_text": "Muttersprache"
                },
                {
                    "label": "Russisch",
                    "level": "12",
                    "level_text": "Muttersprache"
                }
            ]
        },
        "profile": {
            "label": "Profil",
            "text": "<p class='mb-2 text-justify'>Als begeisterte Full-Stack-Webentwicklerin habe ich mich darauf spezialisiert, Portale und Module mit PHP, Python und JavaScript-Frameworks sowie HTML5 und CSS zu erstellen. Meine Erfahrung beinhaltet die Entwicklung neuer Websites und Portale, das Erstellen von Modulen, das Analysieren von HTML-Seiten sowie das Verbessern von WordPress-Themen.</p> <p class='mb-2 text-justify'> Als immer Lernende erkunde ich aktiv aufkommende Technologien während meiner Arbeit. Ich möchte Websites machen, die gut aussehen und ohne Probleme funktionieren. Dabei denke ich an alle wichtigen Dinge.</p> <p class='mb-2 text-justify'> Außerdem kenne ich mich mit regulären Ausdrücken aus, um Daten effizient zu bearbeiten. Ich kann auch gut mit SQL umgehen, sowohl direkt als auch über ORM-Modelle. Mit Begeisterung für die Zufriedenheit der Kunden arbeite ich mit Teams aus verschiedenen Fachbereichen zusammen, um erfolgreiche Projekte umzusetzen.</p>"
        },
        "employment": "Berufserfahrung",
        "employment_arr": [
            {
                "title": "Middle PHP-, JavaScript Programmiererin",
                "firm": "«AWAG IT Lösungen»",
                "period": "05.2022 — 01.2025",
                "text_old": "<section><h4 class='font-medium'>Meine Aufgaben:</h4><ul class='dash-list'><li>Entwicklung von Webanwendungen mit Laravel, Symfony, Vue.js, jQuery, Angular, Bootstrap, Tailwind usw.</li><li>Entwicklung und Anpassung von Modulen für Magento2 und Dolibarr zur Anpassung und Verbesserung der Plattformfunktionalität.</li></ul><h4 class='mt-3 font-medium'>Erworbene Fähigkeiten:</h4><ul class='dash-list'><li>Verbesserte Fähigkeit zur selbstständigen Arbeit und Organisation meiner persönlichen Zeit, um Aufgaben effizient zu erledigen.</li><li>Verbesserte Fähigkeit, die beste Lösung zur Erreichung gesetzter Ziele zu finden.</li><li>Verbesserte Fähigkeit zur pünktlichen Erledigung zugewiesener Aufgaben.</li><li>Arbeit im Team mit regelmäßigem Informationsaustausch für die optimale Aufgabenverteilung.</li><li>Aufbau der kundenspezifischen Struktur und Funktionalität der Anwendung.</li><li>Selbstständige Prüfung abgeschlossener Aufgaben.</li><li>Überprüfung und Code-Review des von anderen Mitarbeitern geschriebenen Codes.</li></ul></section>",
                "text": "<section><p>Als Middle PHP- und JavaScript-Entwicklerin bei „AWAG IT Lösungen“ entwickelte ich Webanwendungen mit Laravel, Symfony, Vue.js, jQuery, Angular, Bootstrap und Tailwind. Ich überarbeitete bestehende und entwickelte neue Module für Magento 2, Dolibarr und WordPress, um die Funktionalität der Plattformen zu verbessern. Dabei arbeitete ich eigenständig, organisierte meine Zeit effizient und habe darauf geachtet, Aufgaben pünktlich zu erledigen. Im Team tauschten wir regelmäßig Informationen aus, um Aufgaben optimal zu verteilen. Außerdem überprüfte ich abgeschlossene Aufgaben und führte Code-Reviews für die Arbeit neuer Mitarbeiter durch.</p></section>"
            },
            {
                "title_old": "Betriebsleiter und ERP-Integrator",
                "title": "Fachkraft für Lager, Buchhaltung und IT-Integration",
                "firm": "«Kainozoe» LLC",
                "period": "01.2017 — 04.2022",
                "text_old": "<section><h4 class='font-medium'>Meine Aufgaben:</h4><ul class='dash-list'><li>Bearbeitung von Kundenbestellungen und Führung der primären Buchhaltung.</li><li>Einrichtung der Automatisierung für die Auftragsabwicklung.</li><li>Lagerbuchhaltung.</li><li>Einrichtung des Kundenportals.</li><li>Implementierung der Automatisierung für das Hinzufügen neuer Produkte zum Buchhaltungssystem unter Verwendung der integrierten Funktionen des Systems und der Entwicklung zusätzlicher Python-Skripte.</li></ul><h4 class='mt-3 font-medium'>Erworbene Fähigkeiten:</h4><ul class='dash-list'><li>Arbeiten mit CRM- und ERP-Systemen, Einrichtung und Automatisierung von Prozessen.</li><li>Grundlegende Buchhaltungsverfahren.</li><li>Verbesserte Fähigkeit zur selbstständigen Arbeit und Organisation meiner persönlichen Zeit, um Aufgaben effizient abzuschließen.</li><li>Verbesserte Kenntnisse in HTML, CSS und JavaScript während der Einrichtung des Kundenportals.</li><li>Durch das Lernen der Programmiersprache Python konnte ich Skripte entwickeln, die die Automatisierung von Prozessen effizienter machen.</li><li>Erwarb die Fähigkeit, mit REST-APIs zu interagieren.</li></ul></section>",
                "text": "<section><p>Auf diese Position habe ich umfangreiche Erfahrung in der Lagerverwaltung und Prozessautomatisierung gesammelt. Zu meinen Aufgaben gehörte die Bearbeitung von Bestellungen von Großhandelskunden, das Erstellen und Verwalten buchhalterischer Dokumente sowie die Durchführung von Abrechnungen mit Kunden.</p><p>Ich war außerdem für die Annahme und Verwaltung von Warenbeständen, die Durchführung von Inventuren und die Kommissionierung von Bestellungen verantwortlich. Darüber hinaus habe ich CRM- und ERP-Systeme konfiguriert und erfolgreich in die Geschäftsprozesse des Unternehmens integriert. Mit Hilfe von Python-Skripten konnte ich Prozesse wie die Aufnahme neuer Artikel in das System und die Synchronisierung von Beständen mit Lieferanten automatisieren.</p></section>"
            },
            {
                "title": "Junior SEO-webtools Entwicklerin",
                "firm": "SEO Studio «Domen PR»",
                "period": "07.2016 — 02.2017",
                "text_old": "<section><h4 class='font-medium'>Meine Aufgaben:</h4><ul class='dash-list'><li>Content-SEO-Optimierung.</li><li>Entwicklung und Anpassung von WordPress-Themen.</li><li>Datenanalyse.</li></ul><h4 class='mt-3 font-medium'>Erworbene Fähigkeiten:</h4><ul class='dash-list'><li>Verbesserte Organisation meiner persönlichen Zeit, um Aufgaben effizienter zu erledigen.</li><li>Verbesserte Fähigkeit, die beste Lösung zur Erreichung gesetzter Ziele zu finden.</li><li>Beherrschung der Verwendung von regulären Ausdrücken zur effektiven Automatisierung der Datenanalyse.</li><li>Anwendung von HTML- und CSS-Kenntnissen bei der Entwicklung von WordPress-Themen.</li><li>Erlernen der Programmiersprache PHP, um WordPress-Themen unabhängig zu entwickeln und anzupassen.</li><li>Arbeiten mit den SQL-Datenbanken zur Migration von Websites zu WordPress aus anderen Content-Management-Systemen.</li><li>Anpassung von Texten, die von Copywritern für SEO-Promotionszwecke verfasst wurden.</li></ul></section>",
                "text": "<section><p>Ich habe mich auf die Content-SEO-Optimierung, die Entwicklung und Anpassung von WordPress-Themen sowie die Datenanalyse spezialisiert. Dabei habe ich meine Fähigkeiten in der Organisation persönlicher Zeit verbessert, um Aufgaben effizient zu erledigen, und gelernt, die besten Lösungen zur Erreichung gesetzter Ziele zu finden.</p><p>Bei der Entwicklung von WordPress-Themen konnte ich meine Kenntnisse in HTML und CSS anwenden und durch das Erlernen der Programmiersprache PHP eigene Themes unabhängig erstellen und anpassen. Ich habe reguläre Ausdrücke genutzt, um die Datenanalyse effektiv zu automatisieren, und mit SQL-Datenbanken gearbeitet, um Websites aus anderen Content-Management-Systemen zu WordPress zu migrieren. Darüber hinaus habe ich Texte, die von Copywritern für SEO-Zwecke erstellt wurden, angepasst und optimiert.</p></section>"
            },
            {
                "title": "Verkäuferin",
                "firm": "Turkul.net",
                "period": "09.2012 - 11.2016 ",
                "text_old": "<section><h4 class='font-medium'>Meine Aufgaben:</h4><ul class='dash-list'><li>Neue Produkte auf der Website des Geschäfts hinzufügen und individuelle sowie umfassende Beschreibungen für sie verfassen.</li><li>Kurze Artikel über das sportliche und Outdoor-Leben der Mitarbeiter für den Unternehmensblog verfassen, um den Laden online zu bewerben.</li><li>Aktive Teilnahme am Design und der Optimierung der Geschäftswebsite.</li><li>Kundenberatung für den Kauf von Outdoor-Ausrüstung und Bekleidung.</li><li>Bearbeitung von Online-Bestellungen.</li><li>Bestellungen bei Lieferanten aufgeben.</li><li>Abgleich der Buchhaltung mit den Lieferanten.</li></ul><h4 class='mt-3 font-medium'>Erworbene Fähigkeiten:</h4><ul class='dash-list'><li>Fähigkeit zur effektiven Kommunikation mit Kunden sowohl persönlich als auch telefonisch oder per E-Mail.</li><li>Auswahl von Ausrüstung, die den individuellen Bedürfnissen der Kunden entspricht, aus dem vorhandenen Sortiment.</li><li>Fähigkeit, unter Druck die optimale Lösung für Probleme zu finden.</li><li>Verbesserte Selbstständigkeit und effiziente Zeitorganisation zur erfolgreichen Erledigung von Aufgaben.</li><li>Arbeit mit Buchhaltungs- und Lagerverwaltungssystemen.</li><li>Vertrautheit mit Content-Management-Systemen.</li><li>Verfassen von prägnanten und informativen Texten sowie Artikeln zur Bewerbung von Produkten oder des Geschäfts.</li></ul></section>",
                "text": "<section><p>Ich habe Erfahrung in der Pflege und Optimierung von Unternehmenswebsites sowie in der Kundenberatung und Auftragsbearbeitung gesammelt. Zu meinen Aufgaben gehörte das Hinzufügen neuer Produkte zur Website des Geschäfts und das Verfassen individueller und detaillierter Beschreibungen. Darüber hinaus habe ich kurze Artikel über das sportliche und Outdoor-Leben der Mitarbeiter für den Unternehmensblog geschrieben, um das Geschäft online zu bewerben.</p><p>Ich war aktiv an der Gestaltung und Optimierung der Geschäftswebsite beteiligt, habe Kunden bei der Auswahl von Outdoor-Ausrüstung und Bekleidung beraten, Online-Bestellungen bearbeitet und Bestellungen bei Lieferanten aufgegeben. Außerdem habe ich die Buchhaltung mit den Lieferanten abgeglichen und mit Buchhaltungs- sowie Lagerverwaltungssystemen gearbeitet.</p><p>Dabei habe ich die Fähigkeit zur effektiven Kommunikation mit Kunden sowohl persönlich als auch per Telefon oder E-Mail entwickelt und gelernt, unter Druck optimale Lösungen für Probleme zu finden.</p></section>"
            },
            {
                "title": "Online-Shop-Manager",
                "firm": "Rozumniki.ua",
                "period": "08.2011 - 08.2012",
                "text_old": "<section><h4 class='font-medium'>Meine Aufgaben:</h4><ul class='dash-list'><li>Bearbeitung von Kundenbestellungen.</li><li>Teilnahme am Produktionsprozess von Schulunterrichtsmaterialien.</li><li>Aufgabe von Bestellungen bei Lieferanten.</li><li>Abgleich der Buchhaltung mit Lieferanten.</li></ul><h4 class='mt-3 font-medium'>Erworbene Fähigkeiten:</h4><ul class='dash-list'><li>Fähigkeit zur Anpassung und Arbeit mit verschiedenen Buchhaltungs- und Content-Management-Systemen.</li><li>Zusammenarbeit mit anderen Abteilungen zur effektiven Erledigung zugewiesener Aufgaben.</li><li>Kommunikationsfähigkeit mit Kunden per Telefon oder E-Mail.</li><li>Entwicklung von Fähigkeiten im Umgang mit Lieferanten durch Aufgeben von Bestellungen und Buchhaltungsabgleich.</li></ul></section>",
                "text": "<section><p>Ich habe Erfahrung in der Bearbeitung von Kundenbestellungen, der Teilnahme am Produktionsprozess von Schulunterrichtsmaterialien und der Zusammenarbeit mit Lieferanten. Zu meinen Aufgaben gehörte auch das Aufgeben von Bestellungen bei Lieferanten und der Abgleich der Buchhaltung mit ihnen.</p><p>Dabei habe ich die Fähigkeit entwickelt, mit verschiedenen Buchhaltungs- und Content-Management-Systemen zu arbeiten, und effektiv mit anderen Abteilungen zusammengearbeitet, um Aufgaben erfolgreich zu erledigen. Meine Kommunikationsfähigkeiten im Umgang mit Kunden per Telefon oder E-Mail wurden ebenfalls gestärkt, ebenso wie mein Umgang mit Lieferanten durch die Abwicklung von Bestellungen und die Klärung buchhalterischer Fragen.</p></section>"
            },
            {
                "title": "Verkäuferin",
                "firm": "El-cap.kiev.ua",
                "period": "09.2009 - 07.2011",
                "text_old": "<section><h4 class='font-medium'>Meine Aufgaben:</h4><ul class='dash-list'><li>Hinzufügen neuer Produkte zur Website des Geschäfts und Verfassen einer einzigartigen und umfassenden Beschreibung für sie.</li><li>Schreiben von kurzen Artikeln über das Sport- und Outdoorleben der Mitarbeiter für den Blog des Geschäfts, um den Laden online zu bewerben.</li><li>Beratung für Käufer von Outdoor-Ausrüstung und Kleidung.</li><li>Bearbeitung von Online-Bestellungen.</li><li>Aufgabe von Bestellungen bei Lieferanten.</li></ul><h4 class='mt-3 font-medium'>Erworbene Fähigkeiten:</h4><ul class='dash-list'><li>Fähigkeit zur Kommunikation mit Kunden sowohl persönlich als auch telefonisch oder per E-Mail.</li><li>Auswahl von Ausrüstung, die den individuellen Bedürfnissen der Kunden aus dem vorhandenen Sortiment entspricht.</li><li>Finden der optimalen Lösung für ein Problem in einer Situation mit hohem Druck.</li><li>Bildung eines Teams zur Lösung eines gegebenen Problems.</li><li>Arbeiten mit Buchhaltungs- und Lagerverwaltungssystemen.</li><li>Arbeiten mit Content-Management-Systemen.</li><li>Verfassen von kurzen und umfassenden Texten und Artikeln zur Produkt- oder Ladenwerbung.</li></ul></section>",
                "text": "<section><p>Meine Hauptaufgabe war die Kommunikation mit Kunden, sowohl persönlich als auch telefonisch oder per E-Mail, um sie bei der Auswahl von Outdoor-Ausrüstung und Kleidung zu beraten. Ich bearbeitete Online-Bestellungen und gab Bestellungen bei Lieferanten auf.</p><p>Zusätzlich war ich verantwortlich für das Hinzufügen neuer Produkte zur Website des Geschäfts und das Verfassen einzigartiger, umfassender Beschreibungen. Ich schrieb kurze Artikel über das Sport- und Outdoorleben der Mitarbeiter für den Blog des Unternehmens, um das Geschäft online zu bewerben.</p></section>"
            },
            {
                "title": "Call-Center Angestellter",
                "firm": "OJSC IVK",
                "period": "06.2006 - 04.2009",
                "text_old": "<section><h4 class='font-medium'>Meine Aufgaben:</h4><ul class='dash-list'><li>Kundenbetreuung für Nutzer von Kabelfernsehen und Kabelinternet.</li><li>Verkauf von Unternehmensdienstleistungen an neue und bestehende Kunden.</li></ul><h4 class='mt-3 font-medium'>Erworbene Fähigkeiten:</h4><ul class='dash-list'><li>Kommunikation mit Kunden per Telefon.</li><li>Stressresistenz.</li><li>Finden der Lösung für ein Problem in einer Situation mit hohem Druck, oft mit begrenzten Informationen.</li><li>Fähigkeit zur Zusammenarbeit mit anderen technischen Abteilungen zur Lösung von Kundenanfragen und -problemen.</li><li>Fähigkeit, äußere Ablenkungen auszublenden und in lauten Umgebungen auf die Arbeit zu konzentrieren.</li></ul></section>",
                "text": "<section><p>Ich war verantwortlich für die Kundenbetreuung von Nutzern von Kabelfernsehen und Kabelinternet sowie für den Verkauf von Unternehmensdienstleistungen an neue und bestehende Kunden. Dabei habe ich meine Kommunikationsfähigkeiten im telefonischen Kundenkontakt weiterentwickelt und gelernt, Lösungen für Probleme auch unter Druck und mit begrenzten Informationen zu finden.</p><p>Ich habe eng mit anderen technischen Abteilungen zusammengearbeitet, um Kundenanfragen und -probleme zu lösen. Meine Stressresistenz konnte ich in herausfordernden Situationen unter Beweis stellen, und ich habe gelernt, äußere Ablenkungen auszublenden, um mich in lauten Umgebungen voll auf meine Aufgaben zu konzentrieren.</p></section>"
            },
            {
                "title": "Laborassistentin",
                "firm": "National Technical University of Ukraine 'Kyiv Polytechnic Institute",
                "period": "11.2002 - 05.2004",
                "text_old": "<section><h4 class='font-medium'>Meine Aufgaben:</h4><ul class='dash-list'><li>Übertragung von handgeschriebenen Texten auf den Computer zur Erstellung von Lehrmaterialien für die Universität.</li></ul><h4 class='mt-3 font-medium'>Erworbene Fähigkeiten:</h4><ul class='dash-list'><li>Gestaltung von Layouts für technische Lehrmaterialien zur Druckvorbereitung.</li><li>Die Umwandlung von Skizzen in vektorbasierte Bilder in MS Word, um eine hochwertige Druckausgabe in verschiedenen Maßstäben zu gewährleisten.</li><li>Effizientes Zeitmanagement zur erfolgreichen Bewältigung von Aufgaben und ohne Beeinträchtigung des Studiums.</li><li>Pünktliche und verantwortungsbewusste Erfüllung zugewiesener Aufgaben.</li></ul></section>",
                "text": "<section><p>Ich war verantwortlich für die Übertragung handgeschriebener Texte auf den Computer, um Lehrmaterialien für die Universität zu erstellen. Dabei habe ich Layouts für technische Lehrmaterialien zur Druckvorbereitung gestaltet und Skizzen in vektorbasierte Bilder in MS Word umgewandelt, um eine hochwertige Druckausgabe in verschiedenen Maßstäben zu gewährleisten.</p><p>Durch diese Tätigkeit habe ich mein Zeitmanagement verbessert, um Aufgaben effizient zu bewältigen, ohne mein Studium zu beeinträchtigen. Ich habe alle zugewiesenen Aufgaben pünktlich und verantwortungsbewusst erfüllt.</p></section>"
            }
        ],
        "education": {
            "label": "Ausbildung",
            "arr": [
                {
                    "title": "Bachelor in elektronischer Ausrüstung",
                    "place": "Educational and Research Institute of Telecommunication Systems in National Technical University of Ukraine “Igor Sikorsky Kyiv Polytechnic Institute”",
                    "period": "09.2002 — 06.2006"
                }
            ]
        },
        "courses": {
            "label": "Weiterbildung",
            "arr": [
                {
                    "title": "Web Programming with Python and JavaScript",
                    "place": "Harvard (edx platform)",
                    "period": "Oktober 2023 — Dezember 2023"
                },
                {
                    "title": "Introduction to Computer Science",
                    "place": "Harvard (Prometeus platform)",
                    "period": "02.2019 — 06.2019"
                }
            ]
        }
    }
}